import { nanoid } from 'nanoid';

export const newsItems = [
  {
    id: nanoid(),
    date: '12 грудня 2021',
    url: 'news/news_1.jpg',
    title: 'Вітаємо нових друзів нашого притулку!',
    description:
      'Сьогодні ми раді вітати нових однодумців, які підтримали наші зусилля у догляді за коровами.',
    text: 'Наші корови живуть у любові та турботі, що дозволяє їм повноцінно реалізовувати свою природну функцію. Але попри всі наші зусилля, притулок стикається з фінансовими труднощами. Зараз ми знаходимося на межі боргів через недостатнє фінансування. На тлі зменшення пожертвувань через війну, ситуація стає критичною. Ми віримо, що спільними зусиллями зможемо подолати цей виклик і продовжити нашу місію.'
  },
  {
    id: nanoid(),
    date: '12 лютого 2022',
    url: 'news/news_2.jpg',
    title: 'Генеральне чищення загонів: нові стандарти чистоти',
    description:
      'Ми провели повне чищення загонів, щоб забезпечити коровам найкращі умови проживання.',
    text: 'Після генерального прибирання наші підопічні, особливо Ярила, виглядають надзвичайно щасливими! Проте, попри нашу важку працю, ми знову стикаємося з нестачею коштів. Ми закликаємо всіх небайдужих допомогти нашому притулку, щоб ми могли продовжувати забезпечувати коровам безпечні та комфортні умови.'
  },
  {
    id: nanoid(),
    date: '12 лютого 2023',
    url: 'news/news_3.jpg',
    title: 'UAnimals надає фінансову допомогу притулку!',
    description:
      'Ми отримали важливу фінансову підтримку від UAnimals, що допоможе забезпечити догляд за коровами.',
    text: 'Ця допомога є критично важливою для нашого притулку, оскільки через зниження пожертвувань наші фінансові ресурси вичерпуються. Завдяки підтримці UAnimals ми зможемо покрити найнеобхідніші витрати та зберегти належні умови для наших корів. Ваша підтримка важлива для кожного мешканця нашого притулку.'
  },
  {
    id: nanoid(),
    date: '12 лютого 2024',
    url: 'news/news_4.jpg',
    title: 'Вирощені вітамінні смаколики для наших підопічних',
    description:
      'Ми успішно виростили вітамінні трави, які забезпечать наших корів важливими поживними речовинами.',
    text: 'Цього року нам вдалося виростити особливі вітамінні трави, які додадуть нашим підопічним енергії та покращать їхнє здоров’я. Проте, фінансова ситуація залишається важкою. Ми продовжуємо боротьбу за кожен день існування притулку. Дякуємо всім, хто вже допоміг, і закликаємо нових благодійників приєднатися до нашої справи!'
  },
  {
    id: nanoid(),
    date: '12 лютого 2025',
    url: 'news/news_5.jpg',
    title: 'Закупили новий запас кормів для зими!',
    description:
      'Перша велика закупівля кормів на зиму вже доставлена до притулку. Тепер корови будуть забезпечені поживними продуктами до весни.',
    text: 'Ми успішно закупили необхідні корми для наших корів, що дозволить забезпечити їх належним харчуванням протягом зимового періоду. Однак, загальна фінансова картина залишається складною. Через війну та перенаправлення пожертвувань, такі притулки, як наш, змушені боротися за виживання. Ми вдячні всім, хто підтримує нас у ці важкі часи.'
  }
];
